     A*------------------------------------------------------------------*  
     A*� Project Name : ==PROJECTNM==                                    *  
     A*� Programmer   : ==PROG=======                                    *  
     A*� Project      : ==PROJECT====                                    *  
     A*� Date         : ==DATE=======                                    *  
     A*� Description  : ==DESC=======                                    *  
     A*------------------------------------------------------------------*  
     A                                      DSPSIZ(24 80 *DS3)              
     A                                      REF(==FILE==  )                 
     A                                      CA03(03)                        
     A                                      CA12(12)                        
     A                                      CF17(17)                        
     A                                      CF19(19)                        
     A                                      CF20(20)                        
     �*------------------------------------------------------------------*  
     A          R HEADER                                                    
     �*------------------------------------------------------------------*  
     A                                  2  1USER                            
     A            INSCRN        50A     2 17                                
     A                                      COLOR(WHT)                      
     A                                  2 72DATE                            
     A                                      EDTCDE(Y)                       
     A                                  3  1'MODE :'                        
     A            INMODE         3A  O 03 08                                
     A                                      COLOR(RED)                      
     A                                  3 72TIME                            
     �*------------------------------------------------------------------*  
     A          R DSPREC=                                                   
     �*------------------------------------------------------------------*  
     A                                      OVERLAY                         
     A                                      CHGINPDFT(LC)                   
     A                                 00 00'...............:'              
     A            FLDSCR    R        B 00 00                                
     A                                 00 00'...............:'              
     A            FLDSCR        00A  B 00 00                                
     A                                 00 00'...............:'              
     A            FLDSCR        00A  B 00 00                                
     A                                 00 00'...............:'              
     A            FLDSCR          Z  B 00 00                                
     A                                 00 00'...............:'              
     A            FLDSCR          D  B 00 00                                
     A N31                                  DSPATR(UL)                      
     A  31                                  DSPATR(PR)                      
     A                                      DSPATR(PR)                      
     �*------------------------------------------------------------------*  
     A          R FOOTER                                                    
     �*------------------------------------------------------------------*  
     A                                      OVERLAY                         
     A                                 22  2'F3=Exit'                       
     A                                      COLOR(BLU)                      
     A                                 22 11'F12=Cancel'                    
     A                                      COLOR(BLU)                      
     A N41                             22 23'F17=Confirm'                   
     A                                      COLOR(BLU)                      
     A N51                             23 02'F19=Previous'                  
     A                                      COLOR(BLU)                      
     A N52                             23 71'F20=Next'                      
     A                                      COLOR(BLU)                      
     A            ERRMSG        70A  O 24  2COLOR(WHT)                      
